import { Component } from '@angular/core';

@Component({
  selector: 'app-service-card',
  standalone: true,
  imports: [],
  templateUrl: './service-card.component.html',
  styleUrl: './service-card.component.css'
})
export class ServiceCardComponent {
serviceCards=[
{
  id:1,
  img:'../../../assets/img/card-1.png',
  title:'Роботизированная установка',
  content:'С учётом сложившейся международной обстановки, понимание сути ресурсосберегающих технологий предопределяет высокую востребованность переосмысления внешнеэкономических политик.'
},
{
  id:2,
  img:'../../../assets/img/box.png',
  title:'Автоматизация и эффективность',
  content:'С учётом сложившейся международной обстановки, понимание сути ресурсосберегающих технологий предопределяет высокую востребованность переосмысления внешнеэкономических политик.'
},
{
  id:3,
  img:'../../../assets/img/search.png',
  title:'Исследование и разработкаь',
  content:'С учётом сложившейся международной обстановки, понимание сути ресурсосберегающих технологий предопределяет высокую востребованность переосмысления внешнеэкономических политик.'
},
{
  id:4,
  img:'../../../assets/img/control-AI.png',
  title:'Управление интеллектуальными устройствами',
  content:'С учётом сложившейся международной обстановки, понимание сути ресурсосберегающих технологий предопределяет высокую востребованность переосмысления внешнеэкономических политик.'
},{
  id:5,
  img:'../../../assets/img/learn.png',
  title:'Обучение аппаратному и программному обеспечению',
  content:'С учётом сложившейся международной обстановки, понимание сути ресурсосберегающих технологий предопределяет высокую востребованность переосмысления внешнеэкономических политик.'
},{
  id:6,
  img:'../../../assets/img/laptop.png',
  title:'Обслуживание клиентов премиум-класса',
  content:'С учётом сложившейся международной обстановки, понимание сути ресурсосберегающих технологий предопределяет высокую востребованность переосмысления внешнеэкономических политик.'
}
]
}
